//  *Валидация*
//        Проверьте данные, на добавление нового фильма или пользователя.
//        Эти данные должны соответствовать определённым критериям.
//        Для Film:
//        * дата релиза — не раньше 1895 года;
//        * продолжительность фильма должна быть положительной.
//        Для User:
//        * имя для отображения может быть пустым — в таком случае будет использован логин;
//        * дата рождения не может быть в будущем.
//
//        Убедитесь, что методы добавления в классе Database корректно обрабатывают новые записи и отклоняют невалидные с соответствующими сообщениями об ошибках.
//        Реализуйте логику, которая позволяет обновлять данные о пользователях и фильмах,
//        при этом сохраняя их валидность.